{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/069a0dd5-cdd3-4a78-bb8f-8b65a00aafaf')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/069a0dd5-cdd3-4a78-bb8f-8b65a00aafaf')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "LSASS MEMORY T1003.001",
                "description": "Parse for LSASS credential dumping. References https://attack.mitre.org/techniques/T1003/001/ & https://medium.com/@markmotig/some-ways-to-dump-lsass-exe-c4a75fdc49bf",
                "severity": "Medium",
                "enabled": true,
                "query": "union DeviceEvents,SecurityEvent,DeviceProcessEvents\r\n| where FileName has_any (\"lsass.dmp\", \"dumpert.dmp\") or CommandLine has_any (\"procdump\", \"lsass\", \"CredentialGuard\", \"Mimikatz\", \"sekurlsa\" \"comsvcs\", \"MiniDump\", \"CredentialGuard\", \"sharpdump\", \"Outflank\", \"createdump\")",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT5H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "CredentialAccess"
                ],
                "techniques": [
                    "T1003"
                ],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "Account"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "Computer"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "FileName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        }
    ]
}
